In [40]:
import pandas as pd

#Pandas 데이터프레임화

#data frame 생성
df = pd.DataFrame((1,2,3,4),(1,2,3,4),columns = ['a'])

#array를 데이터프레임화
import numpy as np
ar = np.array([[1, 2, 3], [4, 5, 6]])
ar = pd.DataFrame(ar)

#dictionary 데이터프레임화
dic = {"a": ['1', '2'], "b": ['3', '4']}
dic = pd.DataFrame(dic)

(df.shape, ar.shape, dic.shape)

((4, 1), (2, 3), (2, 2))

In [61]:
dt = {'name':['kim','lee','son','you'], 'age':['21','30','19','28'],
      'position':['MF','FW','GK','DF'],'goal':['1','4','0','0']}
dt = pd.DataFrame(dt,index = [1,2,3,4])
dt

  name age position goal
1  kim  21       MF    1
2  lee  30       FW    4
3  son  19       GK    0
4  you  28       DF    0

In [62]:
#특정 행 조회(인덱스로 조회)
#데이터명.loc['index명']
dt.loc[1]

name        kim
age          21
position     MF
goal          1
Name: 1, dtype: object

In [64]:
#여러 행 조회 (인덱스 범위 설정)
#데이터명.loc['인덱스1':'인덱스n']
dt.loc[2:4]

  name age position goal
2  lee  30       FW    4
3  son  19       GK    0
4  you  28       DF    0

In [65]:
#특정 칼럼을 조회하면서 특정 행만 조회하기

dt.loc[2:3,['age','goal']]

  age goal
2  30    4
3  19    0

In [68]:
#iloc함수 활용
#인덱스 숫자로 조회하는 함수이므로 인덱스 순서(0부터 시작)대로 출력된다.
dt.iloc[[1,3],2:4]

  position goal
2       FW    4
4       DF    0

In [88]:
#특정 조건에 해당하는 행의 특정 칼럼 조회하기
#이름이 'lee' 이면서 goal을 한 골 넘게 넣은 사람들의 age 칼럼만 출력하기
#먼저 goal칼럼이 object로 저장되어 있어서 astype으로 int로 변환
dt['goal'] = dt['goal'].astype(int)

dt.loc[(dt['name'] == 'lee') & (dt['goal']>= 1), 'age']

2    30
Name: age, dtype: object

In [90]:
#특정 조건행의 칼럼에 새로운 값 넣기

dt.loc[dt['name'] == 'son', 'position'] = 'FW'
dt

  name age position  goal
1  kim  21       MF     1
2  lee  30       FW     4
3  son  19       FW     0
4  you  28       DF     0

In [83]:
dt['goal'].astype(int)

1    1
2    4
3    0
4    0
Name: goal, dtype: int32

In [49]:
#두 개 이상의 열을 조회하려면 대괄호가 두 개
dt[['name','age']]

  name age
1  kim  21
2  lee  30
3  son  19
4  you  28

In [95]:
#새로운 칼럼 추가하기

#새로운 칼럼의 모든 행에 일괄적인 내용 추가하기
dt['nationality'] = 'korea'

#새로운 칼럼의 각 행마다 다른 내용 추가하기
dt['salary'] = [10, 30, 50, 40]

In [60]:
#새로운 칼럼 추가하기

#numpy패키지의 arange 사용해서 새로운 칼럼 생성하고 값 대입하기
dt['back_num'] = np.arange(4)

#Series 형식 데이터 생성 후에 새로운 칼럼으로 추가하기
nationality = pd.Series('korea', index = (1,3))
dt['국적'] = nationality

  name age position goal  back_num     국적
1  kim  21       MF    1         0  korea
2  lee  30       FW    4         1    NaN
3  son  19       GK    0         2  korea
4  you  28       DF    0         3    NaN

In [66]:
#데이터프레임의 모든 칼럼명 조회
dt.columns

Index(['name', 'age', 'position', 'goal'], dtype='object')

In [94]:
#특정 칼럼 삭제하기
#del 데이터명['칼럼']

del dt['salary']

  name age position  goal nationality
1  kim  21       MF     1       korea
2  lee  30       FW     4       korea
3  son  19       FW     0       korea
4  you  28       DF     0       korea

In [101]:
#특정 칼럼 삭제하기
#.drop(['칼럼1','칼럼2'],axis = 'columns', inplace = True)

#dt.drop(['age','nationality'], axis = 'columns', inplace = True)
#dt = dt.drop('name', axis = 'columns', inplace = False)
dt.drop('position', axis = 1)
dt

  position  goal  salary
1       MF     1      10
2       FW     4      30
3       FW     0      50
4       DF     0      40

In [102]:
#특정 행 삭제하기
#.drop([index1, index2], axis = 0, inplace = True)

dt.drop([1, 2], axis = 0, inplace = True)

  position  goal  salary
3       FW     0      50
4       DF     0      40